alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_lcdc.c
/**
  ******************************************************************************
  * @file    rtl8721dhp_lcdc.c
  * @author
  * @version V1.0.0
  * @date    2017-08-14
  * @brief   This file contains all the functions prototypes for the LCDC firmware
  *             library, including the following functionalities of LCD controller:

  *           - MCU I/F Initialization
  *           - TE mode configuration in MCU I/F mode
  *           - VSYNC mode configuration in MCU I/F mode 
  *           - trigger DMA mode configuration in MCU I/F mode
  *           - write/read data through MCU I/F in IO mode
  *           - write command through MCU I/F in IO mode
  *           - RGB I/F Initialization
  *           - RGB I/F configuration for DE mode 
  *           - RGB I/F configuration for HV mode
  *           - Synchronization status acquisition in RGB I/F mode
  *           - LED I/F Initialization
  *           - Color channel and color numbers configuration in LED I/F mode
  *           - Timing configuration in LED I/F mode
  *           - OE active width configuration in LED I/F mode
  *           - LCDC DMA configurations
  *           - Interrupts and flags management
  *
  ******************************************************************************
  * @attention
  *
  * This module is a confidential and proprietary property of RealTek and
  * possession or use of this module requires written permission of RealTek.
  *
  * Copyright(c) 2017, Realtek Semiconductor Corporation. All rights reserved.
  ****************************************************************************** 
  */

#include "ameba_soc.h"
#include "rtl8721d_lcdc.h"

/*-----------------------------------------------MCU I/F functions----------------------------------------------------*/
/**
  * @brief  Fills each LCDC_MCUInitStruct member with its default value.
  * @param  LCDC_MCUInitStruct: pointer to an LCDC_MCUInitTypeDef structure which will be initialized.
  * @retval   None
  */
void LCDC_MCUStructInit(LCDC_MCUInitTypeDef* LCDC_MCUInitStruct)
{
	/* LCDC_MCUInitStruct members default value */
	LCDC_MCUInitStruct->LCDC_MCUIfMode = LCDC_MCU_IF_16_BIT;
	LCDC_MCUInitStruct->LCDC_MCUMode = LCDC_MCU_IO_MODE; 
	LCDC_MCUInitStruct->LCDC_MCUDMAMode = LCDC_AUTO_DMA_MODE;
	LCDC_MCUInitStruct->LCDC_MCUImgHeight = 320; 
	LCDC_MCUInitStruct->LCDC_MCUImgWidth = 240;
	LCDC_MCUInitStruct->LCDC_MCUSyncMode = LCDC_MCU_SYNC_WITH_INTERNAL_CLK;                               
	LCDC_MCUInitStruct->LCDC_MCUVsyncPulPlrty = LCDC_MCU_VSYNC_PUL_LOW_LEV_ACTIVE;
	LCDC_MCUInitStruct->LCDC_MCUTEPulPlrty = LCDC_MCU_TE_PUL_HIGH_LEV_ACTIVE;
	LCDC_MCUInitStruct->LCDC_MCUTEDelay = 5;
	LCDC_MCUInitStruct->LCDC_MCUDataPulPlrty = LCDC_MCU_DAT_PUL_NORMAL;
	LCDC_MCUInitStruct->LCDC_MCURdPulPlrty = LCDC_MCU_RD_PUL_RISING_EDGE_FETCH;
	LCDC_MCUInitStruct->LCDC_MCUWrPulPlrty = LCDC_MCU_WR_PUL_RISING_EDGE_FETCH;
	LCDC_MCUInitStruct->LCDC_MCURsPulPlrty = LCDC_MCU_RS_PUL_LOW_LEV_CMD_ADDR;
	LCDC_MCUInitStruct->LCDC_MCUCsPulPlrty = LCDC_MCU_CS_PUL_LOW_LEV_ACTIVE;
	LCDC_MCUInitStruct->LCDC_MCUVsyncIdlePrd = 128;						  	
	LCDC_MCUInitStruct->LCDC_MCUVsyncSigWidth = 1;
	LCDC_MCUInitStruct->LCDC_MCURdInacvWidth = 2;					  	
	LCDC_MCUInitStruct->LCDC_MCURdAcvWidth = 2;		  	
	LCDC_MCUInitStruct->LCDC_MCUWrPulWidth = 4;
	LCDC_MCUInitStruct->LCDC_MCUIOTimeOutClkNum = 32;
}

/**
  * @brief    Initializes the LCDC peripheral according to the specified
  *               parameters in the LCDC_MCUInitStruct.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  LCDC_MCUInitStruct: pointer to a LCDC_MCUInitTypeDef structure that contains
  *              the configuration information for the specified LCDC peripheral. 
  * @retval None
  */
void LCDC_MCUInit(LCDC_TypeDef* LCDCx, LCDC_MCUInitTypeDef* LCDC_MCUInitStruct)
{
	/*variables for reading register*/
	u32 McuCfgReg;
	u32 McuSyncCfg;
	u32 McuTimingCfg;
	u32 DmaModeCfg;
	u32 PlaneSize;
	u32 LcdcCtrl;

	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));
	assert_param(IS_LCDC_MCU_IF_MODE(LCDC_MCUInitStruct->LCDC_MCUIfMode));
	assert_param(IS_LCDC_MCU_MODE(LCDC_MCUInitStruct->LCDC_MCUMode));
	assert_param(IS_LCDC_DMA_MODE(LCDC_MCUInitStruct->LCDC_MCUDMAMode));
	assert_param(IS_LCDC_MCU_SYNC_MODE(LCDC_MCUInitStruct->LCDC_MCUSyncMode));
	assert_param(IS_LCDC_MCU_VSYNC_PUL_POLARITY(LCDC_MCUInitStruct->LCDC_MCUVsyncPulPlrty));
	assert_param(IS_LCDC_MCU_TE_PUL_POLARITY(LCDC_MCUInitStruct->LCDC_MCUTEPulPlrty));
	assert_param(IS_LCDC_MCU_DAT_PUL_POLARITY(LCDC_MCUInitStruct->LCDC_MCUDataPulPlrty));
	assert_param(IS_LCDC_MCU_RD_PUL_POLARITY(LCDC_MCUInitStruct->LCDC_MCURdPulPlrty));
	assert_param(IS_LCDC_MCU_WR_PUL_POLARITY(LCDC_MCUInitStruct->LCDC_MCUWrPulPlrty));
	assert_param(IS_LCDC_MCU_RS_PUL_POLARITY(LCDC_MCUInitStruct->LCDC_MCURsPulPlrty));
	assert_param(IS_LCDC_MCU_CS_PUL_POLARITY(LCDC_MCUInitStruct->LCDC_MCUCsPulPlrty));

	assert_param((LCDC_MCUInitStruct->LCDC_MCUImgHeight <= 0xfff)&&(LCDC_MCUInitStruct->LCDC_MCUImgWidth <= 0xfff));
	assert_param((LCDC_MCUInitStruct->LCDC_MCUTEDelay>=5) && (LCDC_MCUInitStruct->LCDC_MCUTEDelay<=65539));
	assert_param((LCDC_MCUInitStruct->LCDC_MCUVsyncIdlePrd>=5) && (LCDC_MCUInitStruct->LCDC_MCUVsyncIdlePrd<=0x100000-5));
	assert_param((LCDC_MCUInitStruct->LCDC_MCUVsyncSigWidth>=1) && (LCDC_MCUInitStruct->LCDC_MCUVsyncSigWidth<=0x100));
	assert_param((LCDC_MCUInitStruct->LCDC_MCURdInacvWidth>=1) && (LCDC_MCUInitStruct->LCDC_MCURdInacvWidth<=0x800));
	assert_param((LCDC_MCUInitStruct->LCDC_MCURdAcvWidth>=1) && (LCDC_MCUInitStruct->LCDC_MCURdAcvWidth<=0x800));
	assert_param((LCDC_MCUInitStruct->LCDC_MCUWrPulWidth>=2)&&(LCDC_MCUInitStruct->LCDC_MCUWrPulWidth<=0x400));
	assert_param(LCDC_MCUInitStruct->LCDC_MCUIOTimeOutClkNum<=0xffff);

	/*disable LCDC befrore all operations*/
	/*write 1 to LCDCINSDIS field in register LCDC_CTRL to disable LCDC instantly*/
	LCDCx->LCDC_CTRL |= LCDC_CTRL_LCDCINSDIS;

	/*read registers for configurartion*/
	McuCfgReg = LCDCx->LCDC_MCU_CFG;
	McuSyncCfg = LCDCx->LCDC_MCU_VSYNC_CFG;
	McuTimingCfg = LCDCx->LCDC_MCU_TIMING_CFG;
	DmaModeCfg = LCDCx->LCDC_DMA_MODE_CFG;
	PlaneSize = LCDCx->LCDC_PLANE_SIZE;
	LcdcCtrl = LCDCx->LCDC_CTRL;

	/*IO mode*/
	if(LCDC_MCUInitStruct->LCDC_MCUMode == LCDC_MCU_IO_MODE) {
		
		/*if enable IO mode, the internal clock sychronization must be selected*/
		assert_param(LCDC_MCUInitStruct->LCDC_MCUSyncMode == LCDC_MCU_SYNC_WITH_INTERNAL_CLK);
	} else { /*DMA mode*/
		/*trigger DMA mode*/
		if(LCDC_MCUInitStruct->LCDC_MCUDMAMode == LCDC_TRIGGER_DMA_MODE) {
			
			/*if enable trigger DMA mode, the internal clock sychronization must be selected*/
			assert_param(LCDC_MCUInitStruct->LCDC_MCUSyncMode == LCDC_MCU_SYNC_WITH_INTERNAL_CLK || \
			LCDC_MCUInitStruct->LCDC_MCUSyncMode == LCDC_MCU_SYNC_WITH_VSYNC);
		} else {/*auto DMA mode*/
		
			/*if auto DMA mode is enabled, VSYNC mode or TE mode must be selected*/
			assert_param(LCDC_MCUInitStruct->LCDC_MCUSyncMode != LCDC_MCU_SYNC_WITH_INTERNAL_CLK);
			
			/*Vsync mode*/
			if(LCDC_MCUInitStruct->LCDC_MCUSyncMode == LCDC_MCU_SYNC_WITH_VSYNC) {
				/*if MCU VSYNC mode is used, the VSYNC pulse polarity, VSYNC idle period, VSYNC signal width should be configured*/
				/*VSYNC pulse polarity configuration*/
				McuCfgReg &= (~LCDC_MCU_CFG_MCUSYPL);
				McuCfgReg |= LCDC_MCUInitStruct->LCDC_MCUVsyncPulPlrty;

				/*VSYNC idle period*/
				McuSyncCfg &= (~LCDC_MCU_VSYNC_CFG_MCUVSPD);
				McuSyncCfg |= ((LCDC_MCUInitStruct->LCDC_MCUVsyncIdlePrd-5)<<12);

				/*VSYNC signal width*/
				McuSyncCfg &= (~LCDC_MCU_VSYNC_CFG_MCUVSW);
				McuSyncCfg |= (LCDC_MCUInitStruct->LCDC_MCUVsyncSigWidth-1);
			} else {/*TE mode*/
				/*if MCU TE mode is used, the TE delay interval, TE pulse polarity should be configured*/
				/* TE delay interval configuration*/
				McuCfgReg &= (~LCDC_MCU_CFG_IOMODE_TEDELAY);
				McuCfgReg |= ((LCDC_MCUInitStruct->LCDC_MCUTEDelay-5)<<16);

				/* TE pulse polarityl configuration*/
				McuCfgReg &= (~LCDC_MCU_CFG_TEPL);
				McuCfgReg |= (LCDC_MCUInitStruct->LCDC_MCUTEPulPlrty);
			}
		}
		/*if MCU I/F DMA mode is used, the PLANE size should be configured*/
		PlaneSize &= (~(LCDC_PLANE_SIZE_IMG_HEIGHT | LCDC_PLANE_SIZE_IMG_WIDTH));
		PlaneSize |= LCDC_MCUInitStruct->LCDC_MCUImgWidth;
		PlaneSize |= (LCDC_MCUInitStruct->LCDC_MCUImgHeight<<16);
	}

