alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_lcdc.c
	/*configure MCU mode*/
	McuCfgReg &= (~LCDC_MCU_CFG_IOMODE_EN);
	McuCfgReg |= LCDC_MCUInitStruct->LCDC_MCUMode;

	/*configure MCU sync mode*/
	McuCfgReg &= (~LCDC_MCU_CFG_MCUSYNCMODE);
	McuCfgReg |= LCDC_MCUInitStruct->LCDC_MCUSyncMode;

	/*configure trigger mode or auto DMA*/
	DmaModeCfg &= (~LCDC_DMA_MODE_CFG_TRIGGER_MODE);
	DmaModeCfg |= LCDC_MCUInitStruct->LCDC_MCUDMAMode;

	/*configure MCU I/F mode(8 bit or 16bit)*/
	LcdcCtrl &= (~LCDC_CTRL_IF_MODE);
	LcdcCtrl |= LCDC_MCUInitStruct->LCDC_MCUIfMode;

	/*configure write, read, RS, CS, data pulse polarity*/
	McuCfgReg &= (~(LCDC_MCU_CFG_CSPL|LCDC_MCU_CFG_RSPL|LCDC_MCU_CFG_WRPL|LCDC_MCU_CFG_RDPL|LCDC_MCU_CFG_DATAPL));
	McuCfgReg |= LCDC_MCUInitStruct->LCDC_MCUCsPulPlrty;
	McuCfgReg |= LCDC_MCUInitStruct->LCDC_MCURsPulPlrty;
	McuCfgReg |= LCDC_MCUInitStruct->LCDC_MCUWrPulPlrty;
	McuCfgReg |= LCDC_MCUInitStruct->LCDC_MCURdPulPlrty;
	McuCfgReg |= LCDC_MCUInitStruct->LCDC_MCUDataPulPlrty;
	
	/*WR/RD pulse width*/
	McuTimingCfg &= (~(LCDC_MCU_TIMING_CFG_WRPULW|LCDC_MCU_TIMING_CFG_RDACTW|LCDC_MCU_TIMING_CFG_RDINACTW));
	LCDC_MCUInitStruct->LCDC_MCUWrPulWidth &= (~0x01);
	McuTimingCfg |= (LCDC_MCUInitStruct->LCDC_MCUWrPulWidth-2);
	McuTimingCfg |= ((LCDC_MCUInitStruct->LCDC_MCURdAcvWidth-1)<<10);
	McuTimingCfg |= ((LCDC_MCUInitStruct->LCDC_MCURdInacvWidth-1)<<21);

	/*configure timeout clock number according to write/read clock*/
	LCDC_MCUInitStruct->LCDC_MCUIOTimeOutClkNum = (LCDC_MCUInitStruct->LCDC_MCUWrPulWidth*16 + LCDC_MCUInitStruct->LCDC_MCURdAcvWidth + \
			LCDC_MCUInitStruct->LCDC_MCURdInacvWidth);

	/*configure IO write/read timeout clock number*/
	LCDCx->LCDC_MCU_IO_TO_CFG &= (~LCDC_MCU_IO_TIMEOUT_CLK_NUM);
	LCDCx->LCDC_MCU_IO_TO_CFG |= LCDC_MCUInitStruct->LCDC_MCUIOTimeOutClkNum;	

	/*write the value configured back to registers*/
	LCDCx->LCDC_MCU_CFG = McuCfgReg;
	LCDCx->LCDC_MCU_VSYNC_CFG = McuSyncCfg;
	LCDCx->LCDC_MCU_TIMING_CFG = McuTimingCfg;
	LCDCx->LCDC_DMA_MODE_CFG = DmaModeCfg;
	LCDCx->LCDC_PLANE_SIZE = PlaneSize;
	LCDCx->LCDC_CTRL = LcdcCtrl;
}

/**
  * @brief    Trigger the hardware to transfer one frame from DMA buffer based 
  *               on sync signal.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @retval None
  */
void LCDC_MCUDMATrigger(LCDC_TypeDef* LCDCx)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*write 1 to TRIGER_ONETIME field in register LCDC_DMA_MODE_CFG*/
	LCDCx->LCDC_DMA_MODE_CFG |= LCDC_DMA_MODE_CFG_TRIGGER_ONE_TIME;
}

/**
  * @brief     Get the MCU I/F IO mode run status.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @retval   status value:
  *              - 1: IO mode run
  *              - 0: DMA mode run
  */
u32 LCDC_MCUGetRunStatus(LCDC_TypeDef* LCDCx)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*aquire the IO mode run status*/
	if(LCDCx->LCDC_MCU_CFG & LCDC_MCU_CFG_IOMODE_RUN) {
		return 1;
	} else {
		return 0;
	}
}

/**
  * @brief     write data to MCU I/F bus.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  Data: the data to transmit.
  * @retval   None
  */
void LCDC_MCUIOWriteData(LCDC_TypeDef* LCDCx, u16 Data)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*write data to tx fifo*/
	LCDCx->LCDC_MCU_IO_DATA= ((u32)Data&LCDC_MCU_IO_WR_DAT_FG); 
}

/**
  * @brief     read data from MCU I/F bus.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @retval   the read value
  */
u16 LCDC_MCUIOReadData(LCDC_TypeDef* LCDCx)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*read data from bus*/
	return (u16)LCDCx->LCDC_MCU_IO_DATA; 
}

/**
  * @brief     write command to MCU I/F bus.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  Cmd: the command to transmit.
  * @retval   None
  */
void LCDC_MCUIOWriteCmd(LCDC_TypeDef* LCDCx, u16 Cmd)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*write command to tx fifo*/
	LCDCx->LCDC_MCU_IO_DATA = ((u32)Cmd|LCDC_MCU_IO_WR_CMD_FG);
}

/*--------------------------------------------RGB I/F functions-----------------------------------------------*/
/**
  * @brief  Fills each LCDC_RGBInitStruct member with its default value.
  * @param  LCDC_RGBInitStruct: pointer to an LCDC_RGBInitTypeDef structure which will be initialized.
  * @retval   None
  */
void LCDC_RGBStructInit(LCDC_RGBInitTypeDef *  LCDC_RGBInitStruct)
{
	/* LCDC_MCUInitStruct members default value */
	LCDC_RGBInitStruct->LCDC_RGBIfMode = LCDC_RGB_IF_16_BIT;						 	
	LCDC_RGBInitStruct->LCDC_RGBImgHeight = 272;
	LCDC_RGBInitStruct->LCDC_RGBImgWidth = 480;
	LCDC_RGBInitStruct->LCDC_RGBRefreshFreq = 60;													 	
	LCDC_RGBInitStruct->LCDC_RGBSyncMode = LCDC_RGB_HV_MODE;													 	
	LCDC_RGBInitStruct->LCDC_RGBDatPulPlrty = LCDC_RGB_DAT_PUL_NORMAL;
	LCDC_RGBInitStruct->LCDC_RGBEnPulPlrty = LCDC_RGB_EN_PUL_HIGH_LEV_ACTIVE;	
	LCDC_RGBInitStruct->LCDC_RGBHsPulPlrty = LCDC_RGB_HS_PUL_LOW_LEV_SYNC;
	LCDC_RGBInitStruct->LCDC_RGBVsPulPlrty = LCDC_RGB_VS_PUL_LOW_LEV_SYNC;
	LCDC_RGBInitStruct->LCDC_RGBDclkActvEdge = LCDC_RGB_DCLK_RISING_EDGE_FETCH;
	LCDC_RGBInitStruct->LCDC_RGBVFP = 8;													 	
	LCDC_RGBInitStruct->LCDC_RGBVBP = 8;													 	
	LCDC_RGBInitStruct->LCDC_RGBVSW = 1;														 	
	LCDC_RGBInitStruct->LCDC_RGBHFP= 5;													 	
	LCDC_RGBInitStruct->LCDC_RGBHBP = 40;													 	
	LCDC_RGBInitStruct->LCDC_RGBHSW = 1;
}

/**
  * @brief    Initializes the LCDC peripheral according to the specified
  *               parameters in the LCDC_RGBInitStruct.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  LCDC_RGBInitStruct: pointer to a LCDC_RGBInitTypeDef structure that contains
  *              the configuration information for the specified LCDC peripheral. 
  * @retval None
  */
void LCDC_RGBInit(LCDC_TypeDef* LCDCx, LCDC_RGBInitTypeDef* LCDC_RGBInitStruct)
{

	/*variables for reading register*/
	u32 RgbCfg;
	u32 RgbVsyncCfg;
	u32 RgbHsyncCfg;
	u32 DmaModeCfg;
	u32 PlaneSize;
	u32 LcdcCtrl;

	/*variables for calculating DCLK divider*/
	u32 LcdcClkDiv;
	u32 HDotNum;
	u32 VLineNum;
	u32 TempFreq;
	
