alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_lcdc.c
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));
	assert_param(IS_LCDC_RGB_IF_MODE(LCDC_RGBInitStruct->LCDC_RGBIfMode));
	assert_param(IS_LCDC_RGB_SYNC_MODE(LCDC_RGBInitStruct->LCDC_RGBSyncMode));
	assert_param(IS_LCDC_RGB_DAT_PUL_POLARITY(LCDC_RGBInitStruct->LCDC_RGBDatPulPlrty));
	assert_param(IS_LCDC_RGB_EN_PUL_POLARITY(LCDC_RGBInitStruct->LCDC_RGBEnPulPlrty));
	assert_param(IS_LCDC_RGB_HS_PUL_POLARITY(LCDC_RGBInitStruct->LCDC_RGBHsPulPlrty));
	assert_param(IS_LCDC_RGB_VS_PUL_POLARITY(LCDC_RGBInitStruct->LCDC_RGBVsPulPlrty));
	assert_param(IS_LCDC_RGB_DCLK_EDGE(LCDC_RGBInitStruct->LCDC_RGBDclkActvEdge));

	assert_param((LCDC_RGBInitStruct->LCDC_RGBImgHeight <= 0xfff)&&(LCDC_RGBInitStruct->LCDC_RGBImgWidth<=0xfff));
	assert_param((LCDC_RGBInitStruct->LCDC_RGBVBP>=1)&&(LCDC_RGBInitStruct->LCDC_RGBVBP<=0x10));
	assert_param((LCDC_RGBInitStruct->LCDC_RGBVFP>=1)&&(LCDC_RGBInitStruct->LCDC_RGBVFP<=0x10));
	assert_param((LCDC_RGBInitStruct->LCDC_RGBVSW>=1)&&(LCDC_RGBInitStruct->LCDC_RGBVSW<=0x10));
	assert_param((LCDC_RGBInitStruct->LCDC_RGBHFP>=1)&&(LCDC_RGBInitStruct->LCDC_RGBHFP<=0x100));
	assert_param((LCDC_RGBInitStruct->LCDC_RGBHBP>=1)&&(LCDC_RGBInitStruct->LCDC_RGBHBP<=0x100));
	assert_param((LCDC_RGBInitStruct->LCDC_RGBHSW>=1)&&(LCDC_RGBInitStruct->LCDC_RGBHSW<=0x100));

	/*disable LCDC befrore all operations*/
	/*write 1 to LCDCINSDIS field in register LCDC_CTRL to disable LCDC instantly*/
	LCDCx->LCDC_CTRL |= LCDC_CTRL_LCDCINSDIS;
	
	/*read registers for configurartion*/
	RgbCfg = LCDCx->LCDC_RGB_CFG;
	RgbVsyncCfg = LCDCx->LCDC_RGB_VSYNC_CFG;
	RgbHsyncCfg = LCDCx->LCDC_RGB_HSYNC_CFG;
	DmaModeCfg = LCDCx->LCDC_DMA_MODE_CFG;
	PlaneSize = LCDCx->LCDC_PLANE_SIZE;
	LcdcCtrl = LCDCx->LCDC_CTRL;

	/*if the RGB DE mode is used, configure the DE pulse polarity*/
	if(LCDC_RGBInitStruct->LCDC_RGBSyncMode == LCDC_RGB_DE_MODE) {
		RgbCfg &= (~LCDC_RGB_CFG_ENPL);
		RgbCfg |= LCDC_RGBInitStruct->LCDC_RGBEnPulPlrty;
	}

	/*configure RGB sync mode*/
	RgbCfg &= (~LCDC_RGB_CFG_RGB_SYNC_MODE);
	RgbCfg |= LCDC_RGBInitStruct->LCDC_RGBSyncMode;	

	/*configure plane size*/
	PlaneSize &= (~(LCDC_PLANE_SIZE_IMG_HEIGHT | LCDC_PLANE_SIZE_IMG_WIDTH));
	PlaneSize |= LCDC_RGBInitStruct->LCDC_RGBImgWidth;
	PlaneSize |= (LCDC_RGBInitStruct->LCDC_RGBImgHeight<<16);	

	/*configure RGB I/F mode*/
	LcdcCtrl &= (~LCDC_CTRL_IF_MODE);
	LcdcCtrl |= LCDC_RGBInitStruct->LCDC_RGBIfMode;	

	/*configure RGB data, VSYNC, HSYNC pulse polarity and DCLK active edge*/
	RgbCfg &= (~(LCDC_RGB_CFG_DATPL|LCDC_RGB_CFG_HSPL|LCDC_RGB_CFG_VSPL|LCDC_RGB_CFG_DCLKPL));
	RgbCfg |= LCDC_RGBInitStruct->LCDC_RGBDatPulPlrty;
	RgbCfg |= LCDC_RGBInitStruct->LCDC_RGBHsPulPlrty;
	RgbCfg |= LCDC_RGBInitStruct->LCDC_RGBVsPulPlrty;;
	RgbCfg |= LCDC_RGBInitStruct->LCDC_RGBDclkActvEdge;

	/*configure vertical synchronization parameters: VFP, VBP, VSW*/
	RgbVsyncCfg &= (~(LCDC_RGB_VSYNC_CFG_VSW|LCDC_RGB_VSYNC_CFG_VBP|LCDC_RGB_VSYNC_CFG_VFP));
	RgbVsyncCfg |= (LCDC_RGBInitStruct->LCDC_RGBVSW-1);
	RgbVsyncCfg |= ((LCDC_RGBInitStruct->LCDC_RGBVBP-1)<<8);
	RgbVsyncCfg |= ((LCDC_RGBInitStruct->LCDC_RGBVFP-1)<<16);

	/*configure horizontal synchronization parameters: HFP, HBP, HSW*/
	RgbHsyncCfg &= (~(LCDC_RGB_HSYNC_CFG_HSW|LCDC_RGB_HSYNC_CFG_HBP|LCDC_RGB_HSYNC_CFG_HFP));
	RgbHsyncCfg |= (LCDC_RGBInitStruct->LCDC_RGBHSW-1);
	RgbHsyncCfg |= ((LCDC_RGBInitStruct->LCDC_RGBHBP-1)<<8);
	RgbHsyncCfg |= ((LCDC_RGBInitStruct->LCDC_RGBHFP-1)<<16);

	/*configure auto DMA mode; if LCDC RGB I/F mode is used, the auto DMA mode must be enabled*/
	DmaModeCfg &= (~LCDC_DMA_MODE_CFG_TRIGGER_MODE);
	DmaModeCfg |= LCDC_AUTO_DMA_MODE;

	/*calculate the DCLK clock divider according to the plane size, refreh frequency and LCDC_SYS_CLK*/
	HDotNum = LCDC_RGBInitStruct->LCDC_RGBImgWidth + LCDC_RGBInitStruct->LCDC_RGBHSW + LCDC_RGBInitStruct->LCDC_RGBHBP + \
				LCDC_RGBInitStruct->LCDC_RGBHFP;
	VLineNum = LCDC_RGBInitStruct->LCDC_RGBImgHeight + LCDC_RGBInitStruct->LCDC_RGBVSW + LCDC_RGBInitStruct->LCDC_RGBVBP + \
				LCDC_RGBInitStruct->LCDC_RGBVFP;

	/*if RGB 6bit mode is used, triple the DCLK number in each line*/
	if(LCDC_RGBInitStruct->LCDC_RGBIfMode == LCDC_RGB_IF_6_BIT) {
		HDotNum = 3*HDotNum;
	}

	/*calculate the actual divider*/
	TempFreq = LCDC_RGBInitStruct->LCDC_RGBRefreshFreq*HDotNum*VLineNum;
	if((LCDC_SYS_CLK % TempFreq) >= (TempFreq + 1) / 2){
		LcdcClkDiv = LCDC_SYS_CLK / TempFreq + 1;
	} else {
		LcdcClkDiv = LCDC_SYS_CLK / TempFreq;
	}

	/*Because DCLK=SYS_CLK/(CLKDIV+2), the actual divider must be not less than 2 and not more than 65536*/
	assert_param((LcdcClkDiv>=2)&&((LcdcClkDiv<=65536)));

	/*ensure CLKDIV is a even value*/
	if(LcdcClkDiv%2 != 0){
		LcdcClkDiv = LcdcClkDiv - 1;
	}

	/*fill the CLKDIV field in the register LCDC_CLK_DIV*/
	LCDCx->LCDC_CLK_DIV &= (~LCDC_CLK_DIV_DCLKDIV);
	LCDCx->LCDC_CLK_DIV |= (LcdcClkDiv-2);

	/*write the value configured back to registers*/
	LCDCx->LCDC_RGB_CFG = RgbCfg;
	LCDCx->LCDC_RGB_VSYNC_CFG = RgbVsyncCfg;
	LCDCx->LCDC_RGB_HSYNC_CFG = RgbHsyncCfg;
	LCDCx->LCDC_DMA_MODE_CFG = DmaModeCfg;
	LCDCx->LCDC_PLANE_SIZE = PlaneSize;
	LCDCx->LCDC_CTRL = LcdcCtrl;
}

/**
  * @brief    Get the RGB synchronization status.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  pHSStatus: horizontal synchronization status pointer.
  *		    HSStatus can be one of the following values:
  *     	    @arg LCDC_RGB_SYNC_STATUS_HSYNC:  HSYNC
  *                @arg LCDC_RGB_SYNC_STATUS_HFP    :  HFP
  *     	    @arg LCDC_RGB_SYNC_STATUS_HACTIVE:  ACTIVE
  *                @arg LCDC_RGB_SYNC_STATUS_HBP    :  HBP
  * @param  pVSStatus: vertical synchronization status pointer. 
  *		    VSStatus can be one of the following values:
  *     	    @arg LCDC_RGB_SYNC_STATUS_VSYNC:  VSYNC
  *                @arg LCDC_RGB_SYNC_STATUS_VFP    :  VFP
  *     	    @arg LCDC_RGB_SYNC_STATUS_VACTIVE:  ACTIVE
  *                @arg LCDC_RGB_SYNC_STATUS_VBP    :  VBP
  * @retval None
  */
void LCDC_RGBGetSyncStatus(LCDC_TypeDef* LCDCx, u32 * pHSStatus, u32 * pVSStatus)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*Get horizontal synchronization status*/
	*pHSStatus = (LCDCx->LCDC_RGB_SYNC_STATUS & LCDC_RGB_SYNC_STATUS_HSSTATUS);

