alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_lcdc.c
	/*Get vertical synchronization status*/
	*pVSStatus = (LCDCx->LCDC_RGB_SYNC_STATUS & LCDC_RGB_SYNC_STATUS_VSSTATUS);
}

/*----------------------------------------------LED I/F functions---------------------------------------------*/
/**
  * @brief  Fills each LCDC_LEDInitStruct member with its default value.
  * @param  LCDC_LEDInitStruct: pointer to an LCDC_LEDInitTypeDef structure which will be initialized.
  * @retval   None
  */
void LCDC_LEDStructInit(LCDC_LEDInitTypeDef *  LCDC_LEDInitStruct)
{
	/* LCDC_MCUInitStruct members default value */
	LCDC_LEDInitStruct->LCDC_LEDIfMode = LCDC_LED_IF;
	LCDC_LEDInitStruct->LCDC_LEDImgHeight = 16;
	LCDC_LEDInitStruct->LCDC_LEDImgWidth = 64; 
	LCDC_LEDInitStruct->LCDC_LEDRefreshFreq = 100;
	LCDC_LEDInitStruct->LCDC_LEDColorChnl = LCDC_LED_ONE_CHANNEL;								 	
	LCDC_LEDInitStruct->LCDC_LEDColorNum = LCDC_LED_ONE_COLOR;
	LCDC_LEDInitStruct->LCDC_LEDOEActw = 7;											 	
	LCDC_LEDInitStruct->LCDC_LEDLatchWidth = 2;
	LCDC_LEDInitStruct->LCDC_LEDFrmIdlePd = 2;
	LCDC_LEDInitStruct->LCDC_LEDClkPlrty = LCDC_LED_DCLK_RISING_EDGE_FETCH;
	LCDC_LEDInitStruct->LCDC_LEDLatPlrty = LCDC_LED_LACTH_RISING_EDGE_FETCH;
	LCDC_LEDInitStruct->LCDC_LEDOePlrty = LCDC_LED_OE_LOW_LEV_ACTIVE;
	LCDC_LEDInitStruct->LCDC_LEDDatPlrty = LCDC_LED_DAT_PUL_NORMAL;
	LCDC_LEDInitStruct->LCDC_LEDLineIdlePd = 1;
}

/**
  * @brief    Initializes the LCDC peripheral according to the specified
  *               parameters in the LCDC_LEDInitStruct.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  LCDC_LEDInitStruct: pointer to a LCDC_LEDInitTypeDef structure that contains
  *              the configuration information for the specified LCDC peripheral. 
  * @retval None
  */
void LCDC_LEDInit(LCDC_TypeDef* LCDCx, LCDC_LEDInitTypeDef* LCDC_LEDInitStruct)
{

	/*variables for reading register*/
	u32 LedCfg;
	u32 LedTiming;
	u32 DmaModeCfg;
	u32 PlaneSize;
	u32 LcdcCtrl;
	u32 LedIdle;

	/*variables for calculating DCLK divider*/
	u32 LcdcClkDiv;
	u32 HDotNum;
	u32 VLineNum;
	u32 TempFreq;
	
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));
	assert_param(IS_LCDC_LED_IF_MODE(LCDC_LEDInitStruct->LCDC_LEDIfMode));
	assert_param(IS_LCDC_LED_CHANNEL(LCDC_LEDInitStruct->LCDC_LEDColorChnl));
	assert_param(IS_LCDC_LED_COLOR_NUM(LCDC_LEDInitStruct->LCDC_LEDColorNum));
	assert_param(IS_LCDC_LED_DCLK_EDGE(LCDC_LEDInitStruct->LCDC_LEDClkPlrty));
	assert_param(IS_LCDC_LED_LATCH_EDGE(LCDC_LEDInitStruct->LCDC_LEDLatPlrty));
	assert_param(IS_LCDC_LED_OE_PUL_POLARITY(LCDC_LEDInitStruct->LCDC_LEDOePlrty));
	assert_param(IS_LCDC_LED_DAT_PUL_POLARITY(LCDC_LEDInitStruct->LCDC_LEDDatPlrty));

	assert_param((LCDC_LEDInitStruct->LCDC_LEDImgHeight <= 0xfff)&&(LCDC_LEDInitStruct->LCDC_LEDImgWidth <= 0xfff));
	assert_param((LCDC_LEDInitStruct->LCDC_LEDOEActw >= 1) && (LCDC_LEDInitStruct->LCDC_LEDOEActw <= 0x10000));
	assert_param((LCDC_LEDInitStruct->LCDC_LEDFrmIdlePd >= 1) && (LCDC_LEDInitStruct->LCDC_LEDFrmIdlePd <= 0x1000));
	assert_param((LCDC_LEDInitStruct->LCDC_LEDLatchWidth >= 1) && (LCDC_LEDInitStruct->LCDC_LEDLatchWidth <= 0x100));
	assert_param((LCDC_LEDInitStruct->LCDC_LEDLineIdlePd >= 1) && (LCDC_LEDInitStruct->LCDC_LEDLineIdlePd <= 0x100));

	/*disable LCDC befrore all operations*/
	/*write 1 to LCDCINSDIS field in register LCDC_CTRL to disable LCDC instantly*/
	LCDCx->LCDC_CTRL |= LCDC_CTRL_LCDCINSDIS;

	/*read register for configuration*/
	LedCfg = LCDCx->LCDC_LED_CFG;
	LedTiming = LCDCx->LCDC_LED_TIMING;
	DmaModeCfg = LCDCx->LCDC_DMA_MODE_CFG;
	PlaneSize = LCDCx->LCDC_PLANE_SIZE;
	LcdcCtrl = LCDCx->LCDC_CTRL;
	LedIdle = LCDCx->LCDC_LED_IDLE;

	/*configure LED I/F mode*/
	LcdcCtrl &= (~LCDC_CTRL_IF_MODE);
	LcdcCtrl |= LCDC_LEDInitStruct->LCDC_LEDIfMode;

	/*configure LED plane size*/
	PlaneSize &= (~(LCDC_PLANE_SIZE_IMG_HEIGHT | LCDC_PLANE_SIZE_IMG_WIDTH));
	PlaneSize |= LCDC_LEDInitStruct->LCDC_LEDImgWidth;
	PlaneSize |= (LCDC_LEDInitStruct->LCDC_LEDImgHeight<<16);	
	
	/*configure color channel and color number*/
	LedCfg &= (~(LCDC_LED_CFG_COLORNUM | LCDC_LED_CFG_COLORCHAN));
	LedCfg |= LCDC_LEDInitStruct->LCDC_LEDColorNum;	
	LedCfg |= LCDC_LEDInitStruct->LCDC_LEDColorChnl;

	/*configure LED I/F bus polarity*/
	LedCfg &= (~(LCDC_LED_CFG_CLKPL|LCDC_LED_CFG_LATPL|LCDC_LED_CFG_OEPL|LCDC_LED_CFG_DATPL));
	LedCfg |= LCDC_LEDInitStruct->LCDC_LEDClkPlrty;
	LedCfg |= LCDC_LEDInitStruct->LCDC_LEDLatPlrty;	
	LedCfg |= LCDC_LEDInitStruct->LCDC_LEDOePlrty;
	LedCfg |= LCDC_LEDInitStruct->LCDC_LEDDatPlrty;

	/*configure LED I/F timing*/
	LedTiming &= (~(LCDC_LED_TIMING_LATW | LCDC_LED_TIMING_OEACTW));
	LedTiming |= LCDC_LEDInitStruct->LCDC_LEDLatchWidth-1;
	LedTiming |= ((LCDC_LEDInitStruct->LCDC_LEDOEActw-1)<<8);

	/*configure LED I/F line and frame idle timing*/
	LedIdle &= (~(LCDC_LED_TIMING_LINEIDLE | LCDC_LED_TIMING_FRMIDLEPD));
	LedIdle |= LCDC_LEDInitStruct->LCDC_LEDLineIdlePd-1;
	LedIdle |= ((LCDC_LEDInitStruct->LCDC_LEDFrmIdlePd-1)<<20);

	/*configure auto DMA mode, if LCDC LED I/F mode is used, the auto DMA mode must be enabled*/
	DmaModeCfg &= (~LCDC_DMA_MODE_CFG_TRIGGER_MODE);
	DmaModeCfg |= LCDC_AUTO_DMA_MODE;

	HDotNum = LCDC_LEDInitStruct->LCDC_LEDImgWidth + LCDC_LEDInitStruct->LCDC_LEDLineIdlePd;
	VLineNum = LCDC_LEDInitStruct->LCDC_LEDImgHeight;
	if(LCDC_LEDInitStruct->LCDC_LEDColorChnl == LCDC_LED_TWO_CHANNEL) {
		VLineNum = VLineNum/2;
	}
	TempFreq = (HDotNum*VLineNum+LCDC_LEDInitStruct->LCDC_LEDFrmIdlePd)*LCDC_LEDInitStruct->LCDC_LEDRefreshFreq;

	/*calculate the actual divider*/
	if((LCDC_SYS_CLK % TempFreq) >= (TempFreq + 1) / 2){
		LcdcClkDiv = LCDC_SYS_CLK / TempFreq + 1;
	} else {
		LcdcClkDiv = LCDC_SYS_CLK / TempFreq;
	}

	/*Because DCLK=SYS_CLK/(CLKDIV+2), the actual divider must be not less than 2*/
	assert_param((LcdcClkDiv>=2)&&(LcdcClkDiv<=65536));	

	/*ensure CLKDIV is a even value*/
	if(LcdcClkDiv%2 != 0){
		LcdcClkDiv = LcdcClkDiv - 1;
	}

	/*fill the CLKDIV field in the register LCDC_CLK_DIV*/
	LCDCx->LCDC_CLK_DIV &= (~LCDC_CLK_DIV_DCLKDIV);
	LCDCx->LCDC_CLK_DIV |= (LcdcClkDiv-2);

