alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_lcdc.c
	/*write the value configured back to registers*/
	LCDCx->LCDC_LED_CFG = LedCfg;
	LCDCx->LCDC_LED_TIMING = LedTiming;
	LCDCx->LCDC_DMA_MODE_CFG = DmaModeCfg;
	LCDCx->LCDC_PLANE_SIZE = PlaneSize;
	LCDCx->LCDC_CTRL = LcdcCtrl;
	LCDCx->LCDC_LED_IDLE = LedIdle;
}

/**
  * @brief     Confugure OE active width.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  OEActvWidth: the OE signal active width; Unit: DCLK.
  * @retval   None
  */
void LCDC_LEDSetOEWidth(LCDC_TypeDef* LCDCx, u32 OEActvWidth)
{
	u32 LedTiming;
	
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));
	assert_param((OEActvWidth >= 1) && (OEActvWidth <= 0x1000));

	LedTiming = LCDCx->LCDC_LED_TIMING;

	/*fill the OEACTW field in register LCDC_LED_TIMING*/
	LedTiming &= ~LCDC_LED_TIMING_OEACTW;
	LedTiming |= ((OEActvWidth-1)<<8);
	LCDCx->LCDC_LED_TIMING = LedTiming;
	
	/*set the bit LEDIFUPDATE in register LCDC_LED_CFG*/
	LCDCx->LCDC_LED_CFG |= LCDC_LED_CFG_LEDIFUPDATE;
}

/*-----------------------------------------------DMA functions------------------------------------------------*/
  /**
  * @brief    Configure LCDC DMA burst size .
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  BurstSize: DMA burst size; Unit 64 Bytes.
  * @note     If BurstSize=1, the actual burstsize = 1x64 Bytes; if the BurstSize=2, 
  *                the actual burstsize = 2x64 = 128 Bytes.... The parameter "BurstSize" is not more
  *                than 8.
  * @retval   None
  */
void LCDC_DMAModeConfig(LCDC_TypeDef* LCDCx, u32 BurstSize)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));
	assert_param((BurstSize>=1) && (BurstSize<=8));

	/*fill the RDOTST field in register LCDC_DMA_MODE_CFG*/
	LCDCx->LCDC_DMA_MODE_CFG &= ~LCDC_DMA_MODE_CFG_RDOTST;
	LCDCx->LCDC_DMA_MODE_CFG |= (BurstSize-1)<<2;	
}

  /**
  * @brief    Configure LCDC DMA under flow mode and under flow error data .
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  DmaUnFlwMode: DMA under flow mode, this parameter
  *                can be one of the following values:
  *     	    @arg LCDC_DMAUNFW_OUTPUT_LASTDATA:  output last data
  *                @arg LCDC_DMAUNFW_OUTPUT_ERRORDATA:  output error data
  * @param  ErrorData: the output data when  DMA FIFO underflow occurred. When under flow mode is configured as
  *                LCDC_DMAUNFW_OUTPUT_ERRORDATA, this parameter is needed, and otherwise it can be ignored.
  * @retval   None
  */
void LCDC_DMAUnderFlowConfig(LCDC_TypeDef* LCDCx, u32 DmaUnFlwMode, u32 ErrorData)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));
	assert_param(IS_LCDC_DMA_DMA_UNDERFLOW_MODE(DmaUnFlwMode));
	assert_param(ErrorData <= 0xFFFF);

	/*fill the DMAUNMODE field in register LCDC_UNDFLW_CFG*/
	LCDCx->LCDC_UNDFLW_CFG &= ~LCDC_UNDFLW_CFG_UNDMODE;
	LCDCx->LCDC_UNDFLW_CFG |= DmaUnFlwMode;

	if(DmaUnFlwMode==LCDC_DMAUNFW_OUTPUT_ERRORDATA) {
		/*fill the ERROUTDATA field in register LCDC_UNDFLW_CFG*/
		LCDCx->LCDC_UNDFLW_CFG &= ~LCDC_UNDFLW_CFG_ERROUTDATA;
		LCDCx->LCDC_UNDFLW_CFG |= ErrorData;
	}
}

  /**
  * @brief    Configure image base address.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  ImgBaseAddr: the image base address.
  * @retval   None
  */
void LCDC_DMAImageBaseAddrConfig(LCDC_TypeDef* LCDCx, u32 ImgBaseAddr)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*fill the register LCDC_IMG_BASE_ADDR*/
	LCDCx->LCDC_IMG_BASE_ADDR = ImgBaseAddr;
}
 
/*---------------------------------------Interrupt functions--------------------------------------------*/

/**
  * @brief  Enables or disables the specified LCDC interrupts.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  LCDC_IT: specifies the LCDC interrupts sources to be enabled or disabled. 
  *   This parameter can be any combination of the following values:
  *     @arg LCDC_IT_DMAUNDFW: DMA FIFO underflow interrupt
  *     @arg LCDC_IT_FRDN: LCD refresh done interrupt
  *     @arg LCDC_IT_LINE: line interrupt
  *     @arg LCDC_IT_IO_TIMEOUT: IO write/read timeout interrupt
  *     @arg LCDC_IT_FRM_START: Frame Start interrupt
  * @param  NewState: new state of the specified LCDC interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void LCDC_INTConfig(LCDC_TypeDef* LCDCx, u32 LCDC_IT, u32 NewState)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	if (NewState != DISABLE) {
		/* Enable the selected LCDC interrupts */
		LCDCx->LCDC_IRQ_EN |= LCDC_IT;
	} else {
		/* Disable the selected LCDC interrupts */
		LCDCx->LCDC_IRQ_EN &= (~LCDC_IT);
	}
}

/**
  * @brief   Configure line interrupt position.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  LineNum: the line number. 
  * @retval None
  */
void LCDC_LineINTPosConfig(LCDC_TypeDef* LCDCx, u32 LineNum)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));
	assert_param(LineNum<=0xFFF);

	/*fill the LINE_INT_POS field in register LCDC_LINE_INT_POS*/
	LCDCx->LCDC_LINE_INT_POS &= (~LCDC_LINE_INTPOS);
	LCDCx->LCDC_LINE_INT_POS |= LineNum;
}

/**
  * @brief  Get lcdc interrupt status.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @retval interrupt status
  */
u32 LCDC_GetINTStatus(LCDC_TypeDef* LCDCx)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));	

	return LCDCx->LCDC_IRQ_STATUS;
}

/**
  * @brief  Get LCDC Raw Interrupt Status.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @retval raw interrupt status
  */
u32 LCDC_GetRawINTStatus(LCDC_TypeDef* LCDCx)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));	

	return LCDCx->LCDC_IRQ_RAW;
}

/**
  * @brief  Clears all of the LCDC interrupt pending bit.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @retval None
  */
void LCDC_ClearAllINT(LCDC_TypeDef* LCDCx)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));	

	/*write 1 to clear all interrupts*/
	LCDCx->LCDC_IRQ_STATUS = 0xFFFFFFFF;
}

/**
  * @brief  Clears the LCDC's interrupt pending bits.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  LCDC_IT: specifies the interrupt to be cleared.
  *   This parameter can be any combination of the following values:
  *     @arg LCDC_IT_LINE:line interrupt
  *     @arg LCDC_IT_FRDN: refresh frame done interrupt
  *     @arg LCDC_IT_DMAUNDFW: DMA FIFO under flow interrupt
  *     @arg LCDC_IT_IO_TIMEOUT: IO write/read timeout interrupt
  *     @arg LCDC_IT_FRM_START: Frame Start interrupt
  * @retval None
  */
void LCDC_ClearINT(LCDC_TypeDef* LCDCx, u32 LCDC_IT)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));
	assert_param(IS_LCDC_CLEAR_IT(LCDC_IT));

	/*clear the specified interrupt*/
	LCDCx->LCDC_IRQ_STATUS = LCDC_IT;
}

/**
  * @brief  Get the current position.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  pCurPosX: the current X position pointer.
  * @param  pCurPosY: the current Y position pointer.
  * @retval None
  */
void LCDC_GetCurPosStatus(LCDC_TypeDef* LCDCx, u32* pCurPosX, u32* pCurPosY)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

