alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_lcdc.c
	/*Get the X position*/
	*pCurPosX = (LCDCx->LCDC_CUR_POS_STATUS & LCDC_CUR_POS_STS_X);

	/*Get the Y position*/
	*pCurPosY = ((LCDCx->LCDC_CUR_POS_STATUS & LCDC_CUR_POS_STS_Y)>>16);
}

/**
  * @brief  Get the DMA FIFO under flow interrupt count.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  DmaUnIntCnt: the DMA under flow interrupt count pointer.
  * @retval None
  */
void LCDC_GetDmaUnINTCnt(LCDC_TypeDef* LCDCx, u32* DmaUnIntCnt)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*get the DMA under flow interrupt count*/
	*DmaUnIntCnt = (LCDCx->LCDC_STATUS & LCDC_STATUS_DMAUNINTCNT);
}

/*------------------------------------------------Global  APIs------------------------------------------------*/
/**
  * @brief  Enables or disables the LCDC.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @param  NewState: new state of the LCDC. 
  *   This parameter can be: ENABLE or DISABLE.
  * @note   when NewState is DISABLE, during the period of valid line(VTIMING =valid data), 
  *              the disable action will be performed after the last valid line had transferred. During 
  *              the other periods, performed the disable action instantly. If disable the LCDC instantly,
  *              use the API LCDC_InsDisable().
  * @retval None
  */
void LCDC_Cmd(LCDC_TypeDef* LCDCx, u32 NewState)
{
	u32 TempCtrl;

	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	TempCtrl = LCDCx->LCDC_CTRL;

	if (NewState != DISABLE) {
		/* clear DISABLE bits, or it leads to enable LCDC unsuccessfully*/
		TempCtrl &= ~(LCDC_CTRL_LCDCDIS|LCDC_CTRL_LCDCINSDIS);

		/*set ENBALE bit*/
		TempCtrl |= LCDC_CTRL_LCDCEN;
	} else {

		/*clear instant disable bit*/
		TempCtrl &= ~LCDC_CTRL_LCDCINSDIS;
	
		/*set DISABLE bit*/
		TempCtrl |= LCDC_CTRL_LCDCDIS;
	}

	LCDCx->LCDC_CTRL = TempCtrl;
}

/**
  * @brief  Disable the LCDC instantly.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @note   Disable LCDC instantly. HW will reset LCDC internal states and disable LCDC 
  *              then clear both this bit and LCDCEN.
  * @retval None
  */
void LCDC_InsDisable(LCDC_TypeDef* LCDCx)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*write 1 to LCDCINSDIS field in register LCDC_CTRL to disable LCDC instantly*/
	LCDCx->LCDC_CTRL |= LCDC_CTRL_LCDCINSDIS;
}

/**
  * @brief  Deinitializes the LCDC.
  * @param  LCDCx: where LCDCx can be LCDC.
  * @note   Disable LCDC instantly, clear and disable all interrupts.
  * @retval None
  */
void LCDC_DeInit(LCDC_TypeDef* LCDCx)
{
	/*check the parameters*/
	assert_param(IS_LCDC_ALL_PERIPH(LCDCx));

	/*disable LCDC instantly*/
	LCDCx->LCDC_CTRL |= LCDC_CTRL_LCDCINSDIS;
	
	/*clear all interrupts*/
	LCDCx->LCDC_IRQ_STATUS = 0xFFFFFFFF;

	/*disable all interrupts*/
	LCDCx->LCDC_IRQ_EN = 0;
}
